/*
九九乘法表
小时候学过的九九乘法表也许将会扎根于我们一生的记忆,
现在让我们重温那些温暖的记忆,
请编程输出九九乘法表.
现在要求你输出它的格式与平常的 不同啊!
是那种反过来的三角形啦，
具体如下图：
1*1=1   1*2=2   1*3=3   1*4=4   1*5=5   1*6=6   1*7=7   1*8=8   1*9=9
2*1=2   2*2=4   2*3=6   2*4=8   2*5=10  2*6=12  2*7=14  2*8=16
3*1=3   3*2=6   3*3=9   3*4=12  3*5=15  3*6=18  3*7=21
4*1=4   4*2=8   4*3=12  4*4=16  4*5=20  4*6=24
5*1=5   5*2=10  5*3=15  5*4=20  5*5=25
6*1=6   6*2=12  6*3=18  6*4=24
7*1=7   7*2=14  7*3=21
8*1=8   8*2=16
9*1=9

输入
输入整数N，表示乘法表的行数.
输出
根据要求输出乘法表的前N行,
具体格式参见输入输出样例和上图。
*/
#include <stdio.h>

int main() {
    int n;
    printf("请输入行数:");
    scanf("%d", &n);
    for (int i = 1; i <= n; i++) {
        for (int j = 1; j <= 9; j++) {
            if (j + i <= 10)
                printf("%d*%d=%d\t", j, i, i * j);
        }
        printf("\n");
    }
    return 0;
}